OpenFOAM-v1812/tutorials/multiphase/interFoam/laminar/waveMakerFlap/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     interFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          0.005;

writeControl    adjustableRunTime;

writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           0.65;
maxAlphaCo      0.65;
maxDeltaT       0.05;

functions
{
    line
    {
        type            sets;
        libs            ("libsampling.so");
        enabled         true;
        writeControl    writeTime;

        interpolationScheme cellPoint;
        setFormat       raw;

        sets
        (
            s1
            {
                type            uniform;
                axis            distance;
                start           ( 0.5 0.005 0.0 );
                end             ( 0.5 0.005 0.7 );
                nPoints         1001;
            }

            s2
            {
                type            uniform;
                axis            distance;
                start           ( 1.0 0.005 0.0 );
                end             ( 1.0 0.005 0.7 );
                nPoints         1001;
            }

            s3
            {
                type            uniform;
                axis            distance;
                start           ( 1.5 0.005 0.0 );
                end             ( 1.5 0.005 0.7 );
                nPoints         1001;
            }

            s4
            {
                type            uniform;
                axis            distance;
                start           ( 2.0 0.005 0.0 );
                end             ( 2.0 0.005 0.7 );
                nPoints         1001;
            }

            s5
            {
                type            uniform;
                axis            distance;
                start           ( 2.5 0.005 0.0 );
                end             ( 2.5 0.005 0.7 );
                nPoints         1001;
            }

            s6
            {
                type            uniform;
                axis            distance;
                start           ( 3.0 0.005 0.0 );
                end             ( 3.0 0.005 0.7 );
                nPoints         1001;
            }

            s7
            {
                type            uniform;
                axis            distance;
                start           ( 4.0 0.005 0.0 );
                end             ( 4.0 0.005 0.7 );
                nPoints         1001;
            }
        );

        fixedLocations  false;

        fields          (alpha.water);
    }
}


// ************************************************************************* /
